/*
 * Copyright (c) 2022. JetBrains s.r.o.
 * Use of this source code is governed by the MIT license that can be found in the LICENSE file.
 */

package jetbrains.datalore.plot.builder.presentation

import jetbrains.datalore.base.geometry.DoubleVector
import jetbrains.datalore.base.values.Font


object ClusteringModel {
    private const val BASIC_FAMILY_NAME = "Lucida Grande"
    private const val BASIC_FONT_SIZE = 14

    private val CLUSTERS = listOf(
        listOf(' ', '!', '\'', '(', ')', ',', '-', '.', ':', ';', 'I', '[', ']', 'f', 'i', 'j', 'l', 'r', 't', '¡', '·', '¹', 'Ì', 'Í', 'Î', 'Ï', 'ì', 'í', 'î', 'ï', 'ĩ', 'ī', 'ĭ', 'į', 'ı', 'ĵ', 'ĺ', 'ļ', 'і', 'ї', 'ј'),
        listOf('"', '*', '/', 'J', '\\', '`', 's', 'z', '{', '|', '}', '¦', '¨', 'ª', '°', '²', '³', '´', '¸', 'º', 'Ĩ', 'Ī', 'Ĭ', 'Į', 'İ', 'ľ', 'ŀ', 'ł', 'ŕ', 'ŗ', 'ř', 'š', 'ţ', 'ť', 'ŧ', 'ſ', 'ț', 'ȷ', 'І', 'Ї', 'г', 'ѓ', 'ґ'),
        listOf('$', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '?', 'F', 'L', 'Z', '^', '_', 'a', 'b', 'c', 'd', 'e', 'g', 'h', 'k', 'n', 'o', 'p', 'q', 'u', 'v', 'x', 'y', '¢', '£', '¤', '§', '«', '¯', '±', 'µ', '¶', '»', '¿', 'ß', 'à', 'á', 'â', 'ã', 'ä', 'å', 'ç', 'è', 'é', 'ê', 'ë', 'ð', 'ñ', 'ò', 'ó', 'ô', 'õ', 'ö', '÷', 'ø', 'ù', 'ú', 'û', 'ü', 'ý', 'þ', 'ÿ', 'ā', 'ă', 'ą', 'ć', 'ĉ', 'ċ', 'č', 'ē', 'ĕ', 'ė', 'ę', 'ě', 'ĝ', 'ğ', 'ġ', 'ģ', 'ĥ', 'ħ', 'ĳ', 'Ĵ', 'ķ', 'ĸ', 'Ĺ', 'Ļ', 'Ľ', 'Ł', 'ń', 'ņ', 'ň', 'ŋ', 'ś', 'ŝ', 'ş', 'ũ', 'ū', 'ŭ', 'ů', 'ű', 'ų', 'ŷ', 'ź', 'ż', 'ž', 'ƒ', 'Ɩ', 'Ɨ', 'ƚ', 'ƪ', 'ƫ', 'ƭ', 'ǀ', 'ǃ', 'Ǐ', 'ǐ', 'ǰ', 'ǻ', 'Ȉ', 'ȉ', 'Ȋ', 'ȋ', 'ȑ', 'ȓ', 'ș', 'ȴ', 'ȶ', 'ɉ', 'ɍ', 'Ѓ', 'Ј', 'Г', 'а', 'в', 'д', 'е', 'з', 'и', 'й', 'к', 'л', 'н', 'п', 'с', 'т', 'у', 'х', 'ч', 'ь', 'э', 'я', 'ё', 'ђ', 'є', 'ѕ', 'ћ', 'ќ', 'ў', 'џ', 'Ґ', 'ғ', 'ҭ', 'Ӏ', 'ӏ', 'ӷ', 'ӻ'),
        listOf('#', '+', '<', '=', '>', 'A', 'B', 'C', 'E', 'P', 'R', 'S', 'T', 'V', 'X', 'Y', '~', '¥', '¬', 'À', 'Á', 'Â', 'Ã', 'Ä', 'Å', 'Ç', 'È', 'É', 'Ê', 'Ë', '×', 'Ý', 'Þ', 'Ć', 'Ĉ', 'Ċ', 'Č', 'ď', 'đ', 'Ē', 'Ĕ', 'Ė', 'Ę', 'Ě', 'Ŀ', 'ŉ', 'ō', 'ŏ', 'ő', 'Ś', 'Ŝ', 'Ş', 'Š', 'Ţ', 'Ť', 'Ŧ', 'Ŷ', 'Ÿ', 'Ź', 'Ż', 'Ž', 'ƈ', 'Ɛ', 'ƙ', 'ƛ', 'ơ', 'ƨ', 'ƴ', 'ƶ', 'Ʒ', 'Ƹ', 'ƹ', 'ƺ', 'ƽ', 'ƾ', 'ǁ', 'ǂ', 'ǉ', 'ǎ', 'ǔ', 'ǖ', 'ǘ', 'ǚ', 'ǜ', 'ǝ', 'ǟ', 'ǡ', 'ǧ', 'ǩ', 'Ǯ', 'ǯ', 'ǵ', 'ǹ', 'ǿ', 'ȁ', 'ȃ', 'ȅ', 'ȇ', 'ȕ', 'ȗ', 'Ș', 'Ț', 'Ȝ', 'ȝ', 'ȟ', 'ȥ', 'ȧ', 'ȩ', 'ȳ', 'ȼ', 'ȿ', 'ɀ', 'Ɂ', 'ɂ', 'ɇ', 'Ɉ', 'ɏ', 'Ё', 'Є', 'Ѕ', 'Ќ', 'Ў', 'Б', 'В', 'Е', 'З', 'К', 'Л', 'Р', 'С', 'Т', 'У', 'Ь', 'б', 'м', 'о', 'р', 'ц', 'ъ', 'ѐ', 'ѝ', 'ѧ', 'Ѯ', 'ѯ', 'ҁ', '҂', '҈', '҉', 'ҍ', 'Ғ', 'ҕ', 'Ҙ', 'ҙ', 'Қ', 'қ', 'Ҝ', 'ҝ', 'ҟ', 'ҡ', 'ң', 'ҩ', 'ҫ', 'Ҭ', 'Ү', 'ү', 'Ұ', 'ұ', 'ҳ', 'ҷ', 'ҹ', 'һ', 'ӄ', 'ӌ', 'ӑ', 'ӓ', 'ӗ', 'ә', 'ӛ', 'Ӟ', 'ӟ', 'Ӡ', 'ӡ', 'ӣ', 'ӥ', 'ө', 'ӭ', 'ӯ', 'ӱ', 'ӳ', 'ӵ', 'Ӷ', 'Ӻ', 'ӽ', 'ӿ', 'ԇ', 'Ԑ', 'ԑ', 'ԛ', 'ԟ', 'ԥ'),
        listOf('&', 'D', 'G', 'H', 'K', 'N', 'O', 'Q', 'U', 'w', '©', '®', 'Ð', 'Ñ', 'Ò', 'Ó', 'Ô', 'Õ', 'Ö', 'Ø', 'Ù', 'Ú', 'Û', 'Ü', 'Ā', 'Ă', 'Ą', 'Ď', 'Đ', 'Ĝ', 'Ğ', 'Ġ', 'Ģ', 'Ĥ', 'Ħ', 'Ĳ', 'Ķ', 'Ń', 'Ņ', 'Ň', 'Ŋ', 'Ō', 'Ŏ', 'Ő', 'Ŕ', 'Ŗ', 'Ř', 'Ũ', 'Ū', 'Ŭ', 'Ů', 'Ű', 'Ų', 'ŵ', 'ƀ', 'Ɓ', 'Ƃ', 'ƃ', 'Ƅ', 'ƅ', 'Ɔ', 'Ƈ', 'Ɖ', 'Ƌ', 'ƌ', 'ƍ', 'Ǝ', 'Ə', 'Ƒ', 'Ɣ', 'Ƙ', 'Ɲ', 'ƞ', 'Ơ', 'ƣ', 'Ƥ', 'ƥ', 'Ʀ', 'Ƨ', 'Ʃ', 'Ƭ', 'Ʈ', 'Ư', 'ư', 'Ʊ', 'Ʋ', 'Ƴ', 'Ƶ', 'ƻ', 'Ƽ', 'ƿ', 'Ǎ', 'ǒ', 'Ǔ', 'Ǖ', 'Ǘ', 'Ǚ', 'Ǜ', 'Ǟ', 'Ǡ', 'ǥ', 'Ǩ', 'ǫ', 'ǭ', 'Ƿ', 'Ǹ', 'Ǻ', 'Ǿ', 'Ȁ', 'Ȃ', 'Ȅ', 'Ȇ', 'ȍ', 'ȏ', 'Ȑ', 'Ȓ', 'Ȕ', 'Ȗ', 'Ȟ', 'Ƞ', 'ȡ', 'Ȣ', 'ȣ', 'Ȥ', 'Ȧ', 'Ȩ', 'ȫ', 'ȭ', 'ȯ', 'ȱ', 'Ȳ', 'ȵ', 'Ⱥ', 'Ȼ', 'Ƚ', 'Ⱦ', 'Ƀ', 'Ʉ', 'Ʌ', 'Ɇ', 'Ɋ', 'ɋ', 'Ɍ', 'Ɏ', 'Ѐ', 'Ђ', 'Ћ', 'Ѝ', 'Џ', 'А', 'Д', 'И', 'Й', 'Н', 'О', 'П', 'Ф', 'Х', 'Ц', 'Ч', 'Ъ', 'Э', 'Я', 'ж', 'ф', 'ш', 'щ', 'ы', 'ю', 'њ', 'ѡ', 'ѣ', 'ѥ', 'Ѧ', 'ѩ', 'ѫ', 'ѱ', 'ѳ', 'Ѵ', 'ѵ', 'Ѷ', 'ѷ', 'ѻ', 'ѽ', 'ѿ', 'Ҁ', 'Ҋ', 'ҋ', 'Ҍ', 'Ҏ', 'ҏ', 'Ҕ', 'җ', 'Ҟ', 'Ҡ', 'Ң', 'ҥ', 'Ҩ', 'Ҫ', 'Ҳ', 'ҵ', 'Ҷ', 'Ҹ', 'Һ', 'ҽ', 'ҿ', 'ӂ', 'Ӄ', 'Ӆ', 'ӆ', 'Ӈ', 'ӈ', 'Ӊ', 'ӊ', 'Ӌ', 'ӎ', 'Ӑ', 'Ӓ', 'Ӗ', 'Ә', 'Ӛ', 'ӝ', 'Ӣ', 'Ӥ', 'ӧ', 'Ө', 'ӫ', 'Ӭ', 'Ӯ', 'Ӱ', 'Ӳ', 'Ӵ', 'ӹ', 'Ӽ', 'Ӿ', 'Ԁ', 'ԁ', 'Ԇ', 'ԍ', 'Ԏ', 'ԏ', 'Ԓ', 'ԓ', 'ԕ', 'ԗ', 'Ԛ', 'ԝ', 'Ԟ', 'Ԥ', 'Ԧ', 'ԧ', 'Ԩ', 'ԩ', 'Ԭ', 'ԭ', 'Ԯ', 'ԯ'),
        listOf('%', '@', 'M', 'W', 'm', '¼', '½', '¾', 'Æ', 'æ', 'Œ', 'œ', 'Ŵ', 'Ɗ', 'Ɠ', 'ƕ', 'Ɯ', 'Ɵ', 'Ƣ', 'ǆ', 'Ǉ', 'ǈ', 'ǋ', 'ǌ', 'Ǒ', 'Ǣ', 'ǣ', 'Ǥ', 'Ǧ', 'Ǫ', 'Ǭ', 'ǳ', 'Ǵ', 'Ƕ', 'Ǽ', 'ǽ', 'Ȍ', 'Ȏ', 'Ȫ', 'Ȭ', 'Ȯ', 'Ȱ', 'ȸ', 'ȹ', 'Љ', 'Њ', 'Ж', 'М', 'Ш', 'Щ', 'Ы', 'Ю', 'љ', 'Ѣ', 'Ѥ', 'Ѩ', 'Ѫ', 'Ѭ', 'ѭ', 'Ѱ', 'Ѳ', 'Ѹ', 'ѹ', 'Ѻ', 'Җ', 'Ҥ', 'ҧ', 'Ҵ', 'Ҽ', 'Ҿ', 'Ӂ', 'Ӎ', 'Ӕ', 'ӕ', 'Ӝ', 'Ӧ', 'Ӫ', 'Ӹ', 'Ԃ', 'ԃ', 'Ԅ', 'ԅ', 'Ԉ', 'ԉ', 'Ԋ', 'ԋ', 'Ԍ', 'Ԕ', 'Ԗ', 'Ԙ', 'ԙ', 'Ԝ', 'Ԡ', 'ԡ', 'ԣ', 'ԫ'),
        listOf('Ǆ', 'ǅ', 'Ǌ', 'Ǳ', 'ǲ', 'Ѡ', 'Ѽ', 'Ѿ', 'Ҧ', 'Ԣ', 'Ԫ')
    )

    private val CLUSTER_WIDTH = listOf(
        5.436599423631124,
        8.930740037950665,
        10.384757221880761,
        12.330892143808256,
        13.801235839340885,
        14.918,
        19.282511210762333
    )

    private val DEFAULT_CLUSTER_WIDTH: Double = CLUSTER_WIDTH.sum() / CLUSTER_WIDTH.size

    private val FAMILY_COEFFICIENT = mapOf(
        "Arial" to 0.1921364076488976,
        "Calibri" to -0.6525311548845162,
        "Garamond" to -1.1297678983166575,
        "Geneva" to 0.1921364076488976,
        "Georgia" to 0.17065008326016187,
        "Helvetica" to 0.1921364076488976,
        "Lucida Grande" to 0.1921364076488976,
        "Rockwell" to 0.5214679189726614,
        "Times New Roman" to -1.0963956607837015,
        "Verdana" to 1.4085697162509045
    )

    private val DEFAULT_FAMILY_COEFFICIENT: Double = FAMILY_COEFFICIENT[BASIC_FAMILY_NAME]!!

    private const val SIZE_COEFFICIENT = 0.9824992572627909

    private fun getCharWidth(char: Char): Double {
        val clusterId = CLUSTERS.indexOfFirst { char in it }
        return if (clusterId != -1) CLUSTER_WIDTH[clusterId] else DEFAULT_CLUSTER_WIDTH
    }

    private fun getFamilyCoefficient(font: Font): Double {
        val fontFamily = font.family.toString()
        return if (fontFamily in FAMILY_COEFFICIENT.keys) FAMILY_COEFFICIENT[fontFamily]!! else DEFAULT_FAMILY_COEFFICIENT
    }

    private fun getFaceCoefficient(font: Font): Double {
        return when {
            font.isBold && font.isItalic -> 0.9244505704876518
            font.isBold && !font.isItalic -> 0.698062359998712
            !font.isBold && font.isItalic -> 0.1855573330542257
            else -> 0.007238470980551846
        }
    }

    private fun getSizeCoefficient(font: Font): Double {
        return SIZE_COEFFICIENT * font.size / BASIC_FONT_SIZE
    }

    fun textDimension(
        text: String,
        font: Font,
        multiplicativeCoefficient: Double,
        additiveCoefficient: Double,
    ): DoubleVector {
        if (text.isEmpty()) {
            return DoubleVector.ZERO
        }

        val predictedWidth = text.map(this::getCharWidth).sum()
        val width = getSizeCoefficient(font) * (
            predictedWidth + text.length * (getFamilyCoefficient(font) + getFaceCoefficient(font))
        ) * multiplicativeCoefficient + text.length * additiveCoefficient

        return DoubleVector(width, font.size.toDouble())
    }
}